import 'package:flutter/material.dart';
import 'package:rive/rive.dart' as rive;

class constitution extends StatelessWidget {
  final String text = """সংঘ বিধি/সংবিধান :
১) প্রত্যেক সদস্য মাসিক সঞ্চয় ২০০ (দুইশত) টাকা এবং প্রয়ােজনে প্রতি বছরান্তে সর্বোচ্চ  ৫০০ থেকে১০০০/- (পাঁচ শত থেকে এক হাজার টাকা পর্যন্ত) বিশেষ কালেকশন(বাৎসরিক সঞ্চয়) দিতে বাধ্য থাকিবে।
২) BYC-এর প্রাথমিক মেয়াদ ২ (দুই) বছর পর্যন্ত স্থায়ী থাকিবে
পরবর্তীতে সকলের সিদ্ধান্তক্রমে মেয়াদ বাড়ানাে যাবে।প্রথম প্রাথমিক মেয়াদ  এপ্রিল ২০২১ থেকে মার্চ ২০২৩ পর্যন্ত।
৩) মাসিক সঞ্চয়ের টাকা প্রতিমাসের ১-১২ তারিখের মধ্যে জমা দিতে হবে।
৪)কোন সদস্য যথাসময়ে মাসিক টাকা দিতে না পারলে ২০ (বিশ) টাকা জরিমানা দিতে বাধ্য থাকবে এবং জরিমানার টাকা BYC-এর আয়ের উৎস হিসেবে পরিগণিত হবে।
৫) বিশেষ কালেকশন বা বাৎসরিক ফি এর  টাকা বছরের যে কোন নির্ধারিত সময়ে আদায় করা হবে  এবং যে মাসে আদায় করা হবে ঐ মাসের মাসিক চাঁদাও দিতে হবে।
৬) কোন সদস্য পরপর ০৩ (তিন) মাস টাকা সঞ্চয়ে ব্যর্থ হলে তার সদস্য পদ স্থগিত করা হবে এবং চতুর্থ মাসের মধ্যে সঞ্চয় ও জরিমানা পরিশােধ না করলে কর্মপরিষদ  তার সদস্যপদ সম্পূর্ণ বাতিল করতে পারে তবে কেবল তার সঞ্চয়কৃত অর্থ মেয়াদ শেষে ফেরত পাবে।
৭) কর্মপরিষদ চাইলে বাতিলকৃত সদস্যপদটি নতুন সদস্য দ্বারা পূরণ করতে পারবে।
৮) কোনাে সদস্য মৃত্যুবরণ করলে তার নমিনী উক্ত সদস্য পদ পরিচালনা করতে পারবে।নমিনীর অপরাগতা স্বীকারে কর্মপরিষদের সিদ্ধান্তক্রমে লাভ লােকসান হিসাব অনুযার়ী তার টাকা মেয়াদ শেষে ফেরত দেয়া হবে।
৯) কেউ স্বেচ্ছায় বা অপারগতায় তার মালিকানা হস্তান্তর বা বিক্রয় করতে চাইলে প্রথমে সভাপতি বরাবরে আবেদন দাখিল করতে হবে এবং হস্তান্তর বা বিক্রয়কৃত শেয়ারটি কর্মপরিষদের কাছে গ্রহণযােগ্য হতে হবে।
১০) শেয়ার সংক্রান্তঃ
ক) সর্বোচ্চ শেয়ার ৩০ (ত্রিশ) টির অধিক হতে পারবে না।
খ) একজন ব্যক্তির নামে এক শেয়ার থাকবে এবং তিনি একটি ভােট দিতে পারবেন।
১১) নির্বাচন পদ্ধতিঃ
ক) সকল সদস্যের প্রত্যক্ষ ভােটে সভাপতি, সাধারণ সম্পাদক ও অর্থ সম্পাদক নির্বাচন করা হবে এবং তা হবে প্রার্থী ও প্যানেল বিহীন।
খ) উপরােক্ত নির্বাচিত সদস্যবৃন্দ আরাে ৪ (চার) জন সদস্য
মনােনয়ন দিয়ে ৭ (সাত) জন সদস্য বিশিষ্ট একটি কর্মপরিষদ
গঠন করবে।
গ) প্রত্যেক কর্মপরিষদ ২৪ (চব্বিশ) মাস বা ২(দুই) বছর স্থায়ী হবে এবং পরবর্তী ০৩ (তিন) মাসের মধ্যে নির্বাচনের মাধ্যমে নতুন একটি কর্মপরিষদ গঠন করবে।
১২) BYC এর কার্যক্রম শুরু হওয়ার পরে প্রতি ১২ (বার) মাস অন্তর অন্তর সকল সদস্যের সমন্বয়ে সাধারণ সভা অনুষ্ঠিত হবে।
১৩) কোন সদস্য কোনাে কারণ বশত সাধারণ সভায়/নির্বাচনে উপস্থিত হতে না পারলে তার একজন প্রতিনিধি পাঠাতে হবে, তবে সংস্থার সদস্য ব্যতীত।
১৪) প্রতিনিধির মতামত ও ভােট দান গ্রহণযােগ্য হবে।
১৫)BYC এর সকল সদস্যের অধিকার সমান।
১৬)BYC এর সকল কার্যক্রম কর্মপরিষদ পরিচালনা করবে এবং সকল সদস্য সম্মতি জ্ঞাপন করতে বাধ্য থাকবে।
১৭) কোন সদস্য সংবিধান বহির্ভূত কোনাে কার্যকলাপ করলে বা কোন সদস্যের কারণে BYC ক্ষতিগ্রস্থ কিংবা BYC এর সুনাম ক্ষুন্ন হলে তার ব্যাপারে কর্মপরিষদ কমিটি যে সিদ্ধান্ত নিবে তাতে কারাে কোনাে প্রকার আপত্তি গ্রহণ যােগ্য হবে না।
১৮) BYC এর কর্মপরিষদের সদস্যদের মধ্যে কেউ যদি সংবিধান লঙ্ঘন করে অথবা যথাযথ দায়িত্ব পালন না করে তাহলে নির্বাচিত ব্যক্তিত্রয় (সভাপতি,সাধারণ-সম্পাদক,অর্থ-সম্পাদক) উক্ত সদস্যকে সর্বশক্তিক্রমে কর্মপরিষদের পদ থেকে অপসারণ করতে পারবেন এবং শুন্যপদ ৬০ (ষাট) দিনের মধ্যে পূরণ করবেন।
১৯) BYC এর সাধারণ ৪ (চার) টি সীল (BYC, সভাপতি, সাধারণ সম্পাদক  এবং অর্থ-সম্পাদক) থাকবে।
২০) কোন দলিল বা কাগজে উক্ত সিল প্রদান করার পর তাতে স্বাক্ষর থাকলে তা নির্ভুল হিসেবে গণ্য হবে।
২১) প্রত্যেক সাধারণ সভায়, কর্মপরিষদ তাদের কার্যক্রম সম্পর্কে BYC এর সদস্যদের প্রশ্নালােকে জবাবদিহি করতে বাধ্য থাকবে।
২২)BYC এর যেকোন সিদ্ধান্তের বিষয়ে কর্মপরিষদের অধিকাংশের সম্মতি বা ভােট গৃহীত হবে। আরাে কথা থাকে যে, সীদ্ধান্ত বা মতামতের ব্যাপারে কেউ কাউকে কৈফিয়ত দিতে বাধ্য নয়। এটি একান্ত ব্যক্তিগত স্বাধীনতা।
২৩)নির্বাচিত ৩ (তিন) জন সদস্যদের নামে যৌথ একাউন্ট খােলা হবে।
২৪) BYC কর্তৃক অর্থ প্রাপ্তি ও খরচের হিসাব এবং কি কাজে অর্থ খরচ হয়েছে তার বিবরণ সহ হিসাব অর্থ সম্পাদক রাখবেন।
২৫) BYC কর্তৃক যাবতীয় ক্রয়-বিক্রয়ের বিবরণ ও রশিদ অথবা ভাউচার BYC এর ক্রয়-বিক্রয় ফাইলে সংরক্ষিত থাকবে।
২৬) কোনাে প্রকার বিনিয়ােগের পর একাউন্টে কি পরিমাণ অর্থ আছে তা BYC এর কর্মপরিষদ কমিটি সকল সদস্যকে জানিয়ে দিতে বাধ্য থাকবে।
২৭) ৮০% সদস্যদের সম্মতিক্রমে সংবিধান সংযােজন ও সংশােধন করা হবে।
২৮) যদি BYC বিলােপ সাধন করতে হয়, BYC এর সকল সম্পত্তি বা অর্থ সমভাবে বন্টিত হবে।
২৯) BYC চলার পথে কোন সংকট তৈরী হলে এবং সে বিষয়ে সংবিধানে সুনির্দিষ্ট ভাবে উল্লেখ না থাকলে সংকট সমাধানে BYC এর কর্মপরিষদ সিদ্ধান্ত নেবে। কর্মপরিষদ সিদ্ধান্ত নিতে ব্যর্থ হলে, সভাপতি সাধারণ সভা আহ্বান করে সংকট সমাধানের জন্য গনভোটের ব্যবস্থা করবে।
৩০)BYC উপযুক্ত ব্যবসায়ের সন্ধান পেলে অবশ্যই বিনিয়োগ করবে।সেক্ষেত্রে যে কোন BYC সদস্যের প্রতিষ্ঠান অথবা অসদস্যের প্রতিষ্ঠান হতে পারে, তবে অসদস্যের ক্ষেত্রের BYC থেকে দুজনকে জামিনদার হতে হবে, কিন্তু ব্যক্তি কেন্দ্রীক কেউ ঋণ পাবে না।
৩১)BYC এর সদস্যদের বিপদ সংকুল অবস্থা অথবা কোনো উপযুক্ত মানবিক  কারণ থাকলে BYC থেকে কর্জে হাসনাহ বা হাওলাত নিতে পারবে তবে প্রতিজন সর্বোচ্চ -------/- (,---------) টাকা পর্যন্ত পাবে। এ সুবিধা ভােগকারী অনেকে হতে পারে কিন্তু এ খাতে সর্বোচ্চ........ - (........... হাজার) টাকা পর্যন্ত বরাদ্দ থাকবে। এটি সভাপতির ব্যক্তিগত তত্ত্বাবধানে পরিচালিত হবে। এর জন্য একটি নির্দিষ্ট ফরম পূরণ করতে হবে।
৩২)প্রতি বছর অফিস ফি বাবদ সর্বোচ্চ ১৫০(একশত পঞ্চাশ)  টাকা প্রদান করতে হবে।যা সংগঠনের বিভিন্ন খাতে ব্যয় করা হবে।
[বিঃদ্রঃ ৩১ নং ধারাটি প্রথম অর্থবছরে কার্যকর হবে না এবং ১ম অর্থবছর শেষে ১ম বার্ষিক সভায় সকল সদস্যের উপস্তিতিতে এ ব্যপারে সিদ্ধান্ত নেওয়া হবে।]""";
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: MediaQuery.of(context).size.width > 768
          ? MediaQuery.of(context).size.width > 768 &&
                  MediaQuery.of(context).size.width < 1300
              ? Center(child: physical_model(context))
              : Row(
                  mainAxisAlignment: MainAxisAlignment.center,
                  children: [
                    physical_model(context),
                    Center(
                      child: SizedBox(
                        height: MediaQuery.of(context).size.height * .5,
                        width: MediaQuery.of(context).size.width * .4,
                        child: rive.RiveAnimation.asset("assets/new_file.riv"),
                      ),
                    ),
                  ],
                )
          : conpart(context),
    );
  }

  PhysicalModel physical_model(BuildContext context) {
    return PhysicalModel(
      color: Colors.white,
      elevation: 8,
      shadowColor: Colors.grey,
      borderRadius: BorderRadius.circular(30),
      child: Container(
          height: MediaQuery.of(context).size.height * 0.7,
          width: MediaQuery.of(context).size.width > 1190
              ? MediaQuery.of(context).size.width * 0.3
              : MediaQuery.of(context).size.width * 0.5,
          padding: EdgeInsets.all(10),
          // ignore: prefer_const_constructors
          decoration: BoxDecoration(
            color: Colors.white,
            borderRadius: const BorderRadius.all(
              Radius.circular(30),
            ),
          ),
          child: conpart(context)),
    );
  }

  SafeArea conpart(BuildContext context) {
    return SafeArea(
        child: Padding(
      padding: const EdgeInsets.all(8.0),
      child: SingleChildScrollView(
        child: Text(
          text,
          textAlign: TextAlign.left,
          style: TextStyle(
              fontSize: MediaQuery.of(context).size.width > 768 ? 20 : 17,
              fontFamily: "myfont"),
        ),
      ),
    ));
  }
}
